Repository: xmannv/xkey
Catalog: XKey/Localizable.xcstrings
Source language: vi
Languages: en, zh_hans

source: Nhấn "Thêm quy tắc" để tạo mới
en: Click "Add rule" to create new
zh_hans: 点击"添加规则"创建新规则

source: Nhấn %@ để hiện/ẩn thanh công cụ tại con trỏ
en: Press %@ to show/hide toolbar at cursor
zh_hans: 按 %@ 显示/隐藏光标处的工具栏

source: Nhấn phím tắt hoặc giữ modifier keys 0.5s...
en: Press shortcut or hold modifier keys for 0.5s...
zh_hans: 按快捷键或按住修饰键 0.5 秒...

source: Nhấn phím tắt ngay sau khi gõ để hoàn tác việc bỏ dấu (ví dụ: "tiếng" → "tieesng")
en: Press hotkey right after typing to undo diacritics (e.g., "tiếng" → "tieesng")
zh_hans: 输入后立即按快捷键撤销声调标记（例如："tiếng" → "tieesng"）

source: Nhấn phím tắt này để mở nhanh công cụ chuyển đổi từ bất kỳ đâu
en: Press this hotkey to quickly open convert tool from anywhere
zh_hans: 按此快捷键从任意位置快速打开转换工具

source: Nhấn phím tắt này để nhanh chóng bật/tắt cửa sổ Debug từ bất kỳ ứng dụng nào
en: Press this hotkey to quickly toggle Debug window from any app
zh_hans: 按此快捷键从任意应用快速切换调试窗口

source: Nhấn phím tắt để nhanh chóng bật/tắt tính năng hiệu chỉnh engine theo ứng dụng
en: Press hotkey to quickly toggle per-app engine tuning
zh_hans: 按快捷键快速切换按应用引擎调整

source: Nhấn phím tắt để nhanh chóng bật/tắt tính năng loại trừ ứng dụng
en: Press hotkey to quickly toggle app exclusion
zh_hans: 按快捷键快速切换应用排除

source: Nhấn phím tắt...
en: Press shortcut...
zh_hans: 请按快捷键...

source: Nhấn để ghi phím tắt
en: Click to record shortcut
zh_hans: 点击录制快捷键

source: Nhấn để ghi phím tắt...
en: Click to record shortcut...
zh_hans: 点击录制快捷键...

source: Nhập mã ngôn ngữ ISO 639-1 (2 ký tự):
en: Enter ISO 639-1 language code (2 characters):
zh_hans: 输入ISO 639-1语言代码（2个字符）：

source: Nhập mã ngôn ngữ nguồn
en: Enter source language code
zh_hans: 输入源语言代码

source: Nhập mã ngôn ngữ đích
en: Enter target language code
zh_hans: 输入目标语言代码

source: Nhập nội dung (Enter để xuống dòng)
en: Enter content (Enter for new line)
zh_hans: 输入内容（回车换行）

source: Nhập nội dung thay thế (hỗ trợ nhiều dòng)
en: Enter replacement content (supports multi-line)
zh_hans: 输入替换内容（支持多行）

source: Nhập text để thử dịch...
en: Enter text to test translation...
zh_hans: 输入文本以测试翻译...

source: Nhập từ mới...
en: Enter new word...
zh_hans: 输入新词...

source: Nhớ ngôn ngữ theo ứng dụng
en: Remember language per app
zh_hans: 按应用记住语言

source: Nâng cao
en: Advanced
zh_hans: 高级

source: Nạp
en: Load
zh_hans: 加载

source: Nếu bật: Restore ngay khi thêm dấu không hợp lệ, có thể sẽ gây lỗi từ Tiếng Việt hợp lệ không mong muốn. Nếu tắt: Chờ nhấn Space để restore sẽ chính xác hơn.
en: If enabled: Restore immediately when invalid diacritics are added, may cause unwanted changes to valid Vietnamese words. If disabled: Wait for Space key to restore for better accuracy.
zh_hans: 启用时：添加无效声调标记时立即恢复，可能导致有效越南语单词的意外更改。禁用时：等待空格键后恢复，准确度更高。

source: Nội dung thay thế
en: Replacement content
zh_hans: 替换内容

source: Nội dung thay thế:
en: Replacement content:
zh_hans: 替换内容：

source: Pattern là biểu thức Regular Expression
en: Pattern is a Regular Expression
zh_hans: 模式是正则表达式

source: Phiên bản %@ đã được cài đặt. Vui lòng chuyển sang input method khác rồi quay lại XKey để áp dụng.
en: Version %@ has been installed. Please switch to another input method and switch back to XKey to apply.
zh_hans: 版本 %@ 已安装。 请切换到其他输入法，然后切回 XKey 以应用更新。

source: Phát hiện hiện tại
en: Current Detection
zh_hans: 当前检测

source: Khi bật, nhấp trái vào icon trên thanh menu sẽ chuyển nhanh Việt/Anh. Nhấp phải để mở menu.
en: When enabled, left-click the menu bar icon to quickly switch Vietnamese/English. Right-click to open the menu.
zh_hans: 启用后，左键点击菜单栏图标可快速切换越南语/英语。右键点击打开菜单。

source: Nhấp icon để bật/tắt bộ gõ nhanh
en: Click icon to quickly toggle input
zh_hans: 点击图标快速切换输入法

source: Phát âm thanh khi bật/tắt
en: Play sound on toggle
zh_hans: 切换时播放提示音

source: Phân cách bằng dấu phẩy. Match nếu có BẤT KỲ class nào.
en: Comma-separated. Matches if ANY class present.
zh_hans: 逗号分隔。匹配任意一个类。

source: Phím hoàn tác tiếng Việt
en: Vietnamese undo hotkey
zh_hans: 越南语撤销快捷键

source: Phím tắt
en: Hotkey
zh_hans: 快捷键

source: Phím tắt bật/tắt Debug:
en: Toggle Debug hotkey:
zh_hans: 切换调试快捷键：

source: Phím tắt bật/tắt:
en: Toggle hotkey:
zh_hans: 切换快捷键：

source: Phím tắt chuyển nhanh sang XKey:
en: Quick switch to XKey hotkey:
zh_hans: 快速切换到XKey快捷键：

source: Phím tắt hiện/ẩn:
en: Show/hide hotkey:
zh_hans: 显示/隐藏快捷键：

source: Phím tắt mở công cụ chuyển đổi:
en: Hotkey to open convert tool:
zh_hans: 打开转换工具的快捷键：

source: Phím tắt này sẽ toggle giữa XKey và ABC. Nếu đang dùng XKey → chuyển sang ABC (hoặc bộ gõ tiếng Anh khác), ngược lại → XKey
en: This hotkey toggles between XKey and ABC. If using XKey → switch to ABC (or another English input), vice versa → XKey
zh_hans: 此快捷键在XKey和ABC之间切换。使用XKey时 → 切换到ABC（或其他英文输入），反之 → XKey

source: Phím tắt:
en: Hotkey:
zh_hans: 快捷键：

source: Phím tắt: %@
en: Shortcut: %@
zh_hans: 快捷键:%@

source: Phương thức gửi text:
en: Text sending method:
zh_hans: 文本发送方式：

source: Phụ âm '%@' đã có trong danh sách
en: Consonant '%@' already exists in the list
zh_hans: 辅音"%@"已存在于列表中

source: Quay lại
en: Back
zh_hans: 返回

source: Quick Consonant - Cuối từ
en: Quick Consonant - Word End
zh_hans: 快速辅音 - 词尾

source: Quick Consonant - Đầu từ
en: Quick Consonant - Word Start
zh_hans: 快速辅音 - 词首

source: Quy tắc mặc định (%lld)
en: Default rules (%lld)
zh_hans: 默认规则（%lld）

source: Quy tắc tùy chỉnh (%lld)
en: Custom rules (%lld)
zh_hans: 自定义规则（%lld）

source: Quét mã QR bằng ứng dụng Momo
en: Scan QR code with Momo app
zh_hans: 使用Momo应用扫描二维码

source: Quét mã QR bằng ứng dụng ngân hàng
en: Scan QR code with banking app
zh_hans: 使用银行应用扫描二维码

source: Quản lý Input Sources
en: Manage Input Sources
zh_hans: 管理输入源

source: Quản lý Macro...
en: Manage Macros...
zh_hans: 管理宏...

source: Sai kiểu dữ liệu cho %@: cần %@
en: Wrong data type for %@: expected %@
zh_hans: %@ 的数据类型错误：期望 %@

source: Sang:
en: To:
zh_hans: 到：

source: Sao chép bản dịch
en: Copy translation
zh_hans: 复制翻译

source: Sao lưu
en: Backup
zh_hans: 备份

source: Sao lưu thiết lập
en: Backup Settings
zh_hans: 备份设置

source: Sau khi cài đặt, vào System Settings → Keyboard → Input Sources để thêm XKey Vietnamese
en: After installation, go to System Settings → Keyboard → Input Sources to add XKey Vietnamese
zh_hans: 安装后，前往系统设置 → 键盘 → 输入源 添加 XKey Vietnamese

source: Secure Input đang bật
en: Secure Input is ON
zh_hans: 安全输入已开启

# Showing %lld of %lld entries
source: Showing %1$lld of %2$lld entries
en: Showing %lld of %lld entries
zh_hans: 显示 %lld / %lld 条

source: Sử dụng AX patterns để match
en: Use AX patterns for matching
zh_hans: 使用AX模式进行匹配

source: Sử dụng Marked Text (gạch chân)
en: Use Marked Text (underline)
zh_hans: 使用标记文本（下划线）

source: Sửa Macro
en: Edit Macro
zh_hans: 编辑宏

source: Sửa quy tắc
en: Edit rule
zh_hans: 编辑规则

source: Text đang chọn sẽ bị thay thế bằng bản dịch trong ô nhập liệu.
en: Selected text will be replaced with translation in the input field.
zh_hans: 选中的文本将在输入框中被翻译替换。

source: Thanh công cụ nổi cho phép tạm thời tắt kiểm tra chính tả hoặc bộ gõ Tiếng Việt ngay tại vị trí con trỏ.
en: Floating toolbar to temporarily disable spell check or Vietnamese input at cursor position.
zh_hans: 浮动工具栏，可在光标位置临时禁用拼写检查或越南语输入。

source: Thanh menu
en: Menu Bar
zh_hans: 菜单栏

source: Thay thế text gốc bằng bản dịch
en: Replace original text with translation
zh_hans: 用翻译替换原始文本

source: Thay đổi ngôn ngữ cần khởi động lại ứng dụng để áp dụng.
en: Changing language requires restarting the app to take effect.
zh_hans: 更改语言需要重启应用才能生效。

source: Theo hệ thống
en: System Default
zh_hans: 跟随系统

source: Thiếu giá trị: %@
en: Missing value: %@
zh_hans: 缺少值：%@

source: Thiếu trường: %@
en: Missing field: %@
zh_hans: 缺少字段：%@

source: Thoát XKey
en: Quit XKey
zh_hans: 退出XKey

source: Thành công
en: Success
zh_hans: 成功

source: Thêm
en: Add
zh_hans: 添加

source: Thêm các từ bạn muốn bỏ qua kiểm tra chính tả
en: Add words you want to skip spell check
zh_hans: 添加您想跳过拼写检查的词

source: Thêm dấu cách sau macro
en: Add space after macro
zh_hans: 宏后添加空格

source: Thêm macro
en: Add macro
zh_hans: 添加宏

source: Thêm macro '%@'
en: Add macro '%@'
zh_hans: 添加宏"%@"

source: Thêm macro mới
en: Add new macro
zh_hans: 添加新宏

source: Thêm macro để tự động thay thế từ viết tắt
en: Add macros to auto-replace abbreviations
zh_hans: 添加宏以自动替换缩写

source: Thêm nhanh
en: Quick add
zh_hans: 快速添加

source: Thêm quy tắc
en: Add rule
zh_hans: 添加规则

source: Thêm quy tắc mới
en: Add new rule
zh_hans: 添加新规则

source: Thêm ứng dụng
en: Add app
zh_hans: 添加应用

source: Thêm ứng dụng để tắt gõ tiếng Việt khi sử dụng
en: Add apps to disable Vietnamese typing when in use
zh_hans: 添加应用以在使用时禁用越南语输入

source: Thông báo
en: Notice
zh_hans: 通知

source: Thông tin cơ bản
en: Basic Info
zh_hans: 基本信息

source: Thông tin license từ điển
en: Dictionary license info
zh_hans: 词典许可信息

source: Thử nghiệm
en: Test
zh_hans: 测试

source: Title cửa sổ bắt đầu bằng pattern
en: Window title starts with pattern
zh_hans: 窗口标题以模式开头

source: Title cửa sổ chứa pattern (không phân biệt hoa/thường)
en: Window title contains pattern (case insensitive)
zh_hans: 窗口标题包含模式（不区分大小写）

source: Title cửa sổ khớp chính xác với pattern
en: Window title exactly matches pattern
zh_hans: 窗口标题完全匹配模式

source: Title cửa sổ kết thúc bằng pattern
en: Window title ends with pattern
zh_hans: 窗口标题以模式结尾

source: Tiếng Việt
en: Vietnamese
zh_hans: 越南语

source: Tiếp theo
en: Next
zh_hans: 下一步

source: Toàn bộ cài đặt, macro, từ điển tuỳ chỉnh, quy tắc và cấu hình dịch thuật sẽ bị xoá. XKey sẽ trở về trạng thái như mới cài đặt. Hãy export backup trước nếu bạn muốn giữ lại thiết lập hiện tại.
en: All settings, macros, custom dictionary, rules and translation config will be deleted. XKey will return to factory state. Please export backup first if you want to keep current settings.
zh_hans: 所有设置、宏、自定义词典、规则和翻译配置将被删除。XKey将恢复到出厂状态。 如果要保留当前设置，请先导出备份。

source: Tên:
en: Name:
zh_hans: 名称：

source: Tìm kiếm...
en: Search...
zh_hans: 搜索...

source: Tính năng này yêu cầu macOS 13.0 trở lên
en: This feature requires macOS 13.0 or later
zh_hans: 此功能需要macOS 13.0或更高版本

source: Tùy chỉnh Injection Delays
en: Custom Injection Delays
zh_hans: 自定义注入延迟

source: Tùy chọn
en: Options
zh_hans: 选项

source: Tùy chọn khác
en: Other Options
zh_hans: 其他选项

source: Tăng cỡ chữ
en: Increase font size
zh_hans: 增大字号

source: Tạo quy tắc mới với thông tin đã phát hiện
en: Create new rule with detected info
zh_hans: 使用检测到的信息创建新规则

source: Tải lại
en: Reload
zh_hans: 重新加载

source: Tải từ điển (~200KB)
en: Download dictionary (~200KB)
zh_hans: 下载词典 (~200KB)

source: Tải từ điển thành công!
en: Dictionary downloaded successfully!
zh_hans: 词典下载成功！

source: Tất cả
en: All
zh_hans: 全部

source: Tất cả macro sẽ bị xóa vĩnh viễn. Bạn có chắc chắn?
en: All macros will be permanently deleted. Are you sure?
zh_hans: 所有宏将被永久删除。确定吗？

source: TẮT
en: OFF
zh_hans: 关

source: Tắt Debug Window
en: Close Debug Window
zh_hans: 关闭调试窗口

source: Tắt quy tắc này
en: Disable this rule
zh_hans: 禁用此规则

source: Tắt tất cả
en: Disable all
zh_hans: 全部禁用

source: Từ viết tắt
en: Abbreviation
zh_hans: 缩写

source: Từ viết tắt phải có ít nhất 1 ký tự
en: Abbreviation must be at least 1 character
zh_hans: 缩写至少需要1个字符

source: Từ viết tắt:
en: Abbreviation:
zh_hans: 缩写：

source: Từ điển chứa các từ đơn tiếng Việt.
en: Dictionary contains Vietnamese single words.
zh_hans: 词典包含越南语单词。

source: Từ điển cá nhân
en: Personal Dictionary
zh_hans: 个人词典

source: Từ điển đã tải về nhưng chưa được nạp
en: Dictionary downloaded but not loaded
zh_hans: 词典已下载但未加载

source: Từ:
en: From:
zh_hans: 从：

source: Tự động chuyển Input Source
en: Auto-switch Input Source
zh_hans: 自动切换输入源

source: Tự động chuyển ngôn ngữ khi chuyển app
en: Auto-switch language when switching apps
zh_hans: 切换应用时自动切换语言

source: Tự động copy bản dịch vào clipboard
en: Auto-copy translation to clipboard
zh_hans: 自动将翻译复制到剪贴板

source: Tự động kiểm tra bản cập nhật
en: Auto check for updates
zh_hans: 自动检查更新

source: Tự động mở Debug khi khởi động app
en: Auto-open Debug on app launch
zh_hans: 应用启动时自动打开调试

source: Tự động viết hoa chữ đầu câu
en: Auto capitalize first letter of sentence
zh_hans: 自动大写句首字母

source: Tự động viết hoa macro
en: Auto capitalize macros
zh_hans: 自动大写宏

source: Tự ẩn popup sau:
en: Auto-hide popup after:
zh_hans: 弹窗自动隐藏时间：

source: VD: 5000
en: e.g., 5000
zh_hans: 例如:5000

source: VD: AXTextArea
en: e.g., AXTextArea
zh_hans: 例如:AXTextArea

source: VD: Google Docs
en: e.g.: Google Docs
zh_hans: 例：Google Docs

source: VD: Google Docs (để trống = tất cả)
en: e.g.: Google Docs (empty = all)
zh_hans: 例：Google Docs（留空 = 全部）

source: VD: Terminal 1
en: e.g., Terminal 1
zh_hans: 例如:Terminal 1

source: VD: notranslate, code-block
en: e.g., notranslate, code-block
zh_hans: 例如:notranslate, code-block

source: VD: pt, ar, hi, bn...
en: e.g.: pt, ar, hi, bn...
zh_hans: 例：pt, ar, hi, bn...

source: VD: urlbar-input
en: e.g., urlbar-input
zh_hans: 例如:urlbar-input

source: Tự nhận kiểu gõ (Telex + VNI)
en: Adaptive Input (Telex + VNI)
zh_hans: 自适应输入 (Telex + VNI)

source: Viết hoa chữ đầu
en: Capitalize first
zh_hans: 首字母大写

source: Viết hoa mỗi từ
en: Capitalize Each Word
zh_hans: 每个单词首字母大写

source: Viết hoa tất cả
en: UPPERCASE
zh_hans: 全部大写

source: Viết thường tất cả
en: lowercase
zh_hans: 全部小写

source: Vui lòng liên hệ developer
en: Please contact the developer
zh_hans: 请联系开发者

source: Vui lòng nhập tên quy tắc
en: Please enter rule name
zh_hans: 请输入规则名称

source: Vui lòng nhập đầy đủ thông tin
en: Please fill in all fields
zh_hans: 请填写所有字段

source: Ví dụ: com.apple.Safari hoặc * để match tất cả
en: Example: com.apple.Safari or * to match all
zh_hans: 示例：com.apple.Safari 或 * 匹配所有

source: Văn bản gốc
en: Source Text
zh_hans: 源文本

source: XKey có thể tự động bật/tắt tính năng thêm dấu tiếng Việt dựa trên Input Source hiện tại của hệ điều hành.
en: XKey can automatically enable/disable Vietnamese diacritics based on the current OS Input Source.
zh_hans: XKey可以根据当前操作系统输入源自动启用/禁用越南语声调标记。

source: XKey sẽ tự động chuyển sang Input Source đã chọn.
en: XKey will auto-switch to the selected Input Source.
zh_hans: XKey将自动切换到所选输入源。

source: XKey sẽ tự động khởi động lại sau
en: XKey will automatically restart in
zh_hans: XKey将自动重启，倒计时

source: XKey sẽ ưu tiên từ điển để xác định chính tả Tiếng Việt và tự động hoàn tác nếu từ đang gõ không tồn tại trong từ điển này. Bạn cũng có thể thêm các "Từ điển cá nhân" để bỏ qua việc kiểm tra chính tả đối với các từ mà bạn coi là hợp lệ.
en: XKey uses this dictionary to verify Vietnamese spelling and auto-restore if the typed word doesn't exist. You can also add words to "Personal Dictionary" to skip spell check for words you consider valid.
zh_hans: XKey使用此词典验证越南语拼写，如果输入的词不存在则自动恢复。您也可以将词添加到"个人词典"中，以跳过您认为有效的词的拼写检查。

source: XKeyIM là Input Method chạy song song với XKey, cho phép gõ tiếng Việt trong các ứng dụng có độ trễ phản hồi thấp hoặc có cơ chế autocomplete như Terminal/Spotlight/Address Bar một cách mượt mà.
en: XKeyIM is an Input Method that runs alongside XKey, enabling smooth Vietnamese typing in apps with low response latency or autocomplete like Terminal/Spotlight/Address Bar.
zh_hans: XKeyIM是与XKey并行运行的输入法，可在终端/Spotlight/地址栏等低延迟或自动完成的应用中流畅输入越南语。

source: XKeyIM sử dụng phím ESC làm phím hoàn tác mặc định (không thể tùy chỉnh do hạn chế của Input Method Kit). Bấm ESC khi đang gõ từ có dấu tiếng Việt ("thử") sẽ hoàn tác thành "thur". Nếu từ chưa có dấu ("thu") hoặc không có gì để hoàn tác, ESC sẽ được gửi tới ứng dụng như bình thường.
en: XKeyIM uses ESC as default undo key (not customizable due to Input Method Kit limitations). Pressing ESC while typing a Vietnamese word with diacritics ("thử") will undo to "thur". If the word has no diacritics ("thu") or nothing to undo, ESC is sent to the app as normal.
zh_hans: XKeyIM使用ESC作为默认撤销键（由于输入法套件限制不可自定义）。在输入带声调的越南语词（如"thử"）时按ESC将撤销为"thur"。如果词没有声调（如"thu"）或无需撤销，ESC将正常发送给应用。

source: XKeyIM đã được cài đặt. Vui lòng vào System Settings → Keyboard → Input Sources để bật XKey Vietnamese.
en: XKeyIM has been installed. Please go to System Settings → Keyboard → Input Sources to enable XKey Vietnamese.
zh_hans: XKeyIM已安装。 请前往系统设置 → 键盘 → 输入源 启用 XKey Vietnamese。

source: XKeyIM đã được cập nhật
en: XKeyIM has been updated
zh_hans: XKeyIM 已更新

source: XKeyIM đã được gỡ bỏ.
en: XKeyIM has been removed.
zh_hans: XKeyIM已被移除。

source: XKeyIM.app không có trong bundle. Vui lòng tải phiên bản đầy đủ từ GitHub.
en: XKeyIM.app is not in the bundle. Please download the full version from GitHub.
zh_hans: XKeyIM.app不在应用包中。请从GitHub下载完整版本。

source: Xem danh sách
en: Show list
zh_hans: 显示列表

source: Xoá toàn bộ cài đặt, macro, từ điển, quy tắc tuỳ chỉnh và cấu hình dịch thuật. Thao tác này không thể hoàn tác.
en: Delete all settings, macros, dictionary, custom rules and translation config. This action cannot be undone.
zh_hans: 删除所有设置、宏、词典、自定义规则和翻译配置。此操作不可撤销。

source: Xóa
en: Delete
zh_hans: 删除

source: Xóa (convert)
en: Clear
zh_hans: 清除

source: Xóa dấu tiếng Việt
en: Remove Vietnamese diacritics
zh_hans: 去除越南语声调标记

source: Xóa phím tắt
en: Clear hotkey
zh_hans: 清除快捷键

source: Xóa tất cả
en: Delete all
zh_hans: 全部删除

source: Xóa tất cả macro?
en: Delete all macros?
zh_hans: 删除所有宏？

source: giây
en: seconds
zh_hans: 秒

source: giữ 0.5s...
en: hold 0.5s...
zh_hans: 按住0.5秒...

# v%@ (%@)
source: v%1$@ (%2$@)
en: v%@ (%@)
zh_hans: v%@ (%@)

source: vd: btw, ưa, việt
en: e.g.: btw, ưa, việt
zh_hans: 例：btw, ưa, việt

source: Đang chạy
en: Running
zh_hans: 正在运行

source: Đang dùng mã tùy chỉnh:
en: Using custom code:
zh_hans: 使用自定义代码：

source: Đang tải danh sách Input Sources...
en: Loading Input Sources list...
zh_hans: 加载输入源列表...

source: Đang tải...
en: Loading...
zh_hans: 加载中...

source: Đã export %lld macro
en: Exported %lld macros
zh_hans: 已导出 %lld 个宏

source: Đã export thiết lập thành công
en: Settings exported successfully
zh_hans: 设置导出成功

source: Đã import %lld macro mới
en: Imported %lld new macros
zh_hans: 已导入 %lld 个新宏

source: Đã import %lld quy tắc thành công
en: Successfully imported %lld rules
zh_hans: 成功导入 %lld 条规则

source: Đã import %lld từ thành công
en: Successfully imported %lld words
zh_hans: 成功导入 %lld 个词

source: Đã khôi phục mặc định!
en: Reset to default complete!
zh_hans: 已恢复默认！

source: Đã tải từ điển (%lld từ)
en: Dictionary loaded (%lld words)
zh_hans: 词典已加载（%lld 个词）

source: Đã vượt quá giới hạn yêu cầu. Vui lòng thử lại sau.
en: Request limit exceeded. Please try again later.
zh_hans: 已超出请求限制。请稍后重试。

source: Đã xuất %lld quy tắc thành công
en: Successfully exported %lld rules
zh_hans: 成功导出 %lld 条规则

source: Đã xuất %lld từ thành công
en: Successfully exported %lld words
zh_hans: 成功导出 %lld 个词

source: Đóng
en: Close
zh_hans: 关闭

source: Đặt lại toàn bộ thiết lập về trạng thái ban đầu
en: Reset all settings to initial state
zh_hans: 将所有设置重置为初始状态

source: Để sau
en: Later
zh_hans: 稍后

source: Để tránh xung đột, vào System Settings → Keyboard → Keyboard Shortcuts → Input Sources và tắt các phím tắt chuyển đổi nguồn nhập.
en: To avoid conflicts, go to System Settings → Keyboard → Keyboard Shortcuts → Input Sources and disable input source shortcuts.
zh_hans: 为避免冲突，请前往系统设置 → 键盘 → 键盘快捷键 → 输入源，关闭输入源快捷键。

source: Đổi
en: Change
zh_hans: 更改

source: Đổi ngôn ngữ nguồn ↔ đích
en: Swap source ↔ target language
zh_hans: 交换源↔目标语言

source: Ẩn danh sách
en: Hide list
zh_hans: 隐藏列表

source: • Bấm phím tắt Ctrl/Option để bật/tắt tính năng
en: • Press Ctrl/Option hotkey to toggle the feature
zh_hans: • 按 Ctrl/Option 快捷键切换功能

source: • Bấm vào nút trên thanh công cụ để bật/tắt tính năng
en: • Click the toolbar button to toggle the feature
zh_hans: • 点击工具栏按钮切换功能

source: • Một dự án mã nguồn mở
en: • An open-source project
zh_hans: • 一个开源项目

source: • Nguồn: hunspell-vi by Minh Nguyen
en: • Source: hunspell-vi by Minh Nguyen
zh_hans: • 来源:hunspell-vi by Minh Nguyen

source: • Nhấn %@ để hiện/ẩn thanh công cụ tại con trỏ
en: • Press %@ to show/hide the toolbar at the cursor
zh_hans: • 按 %@ 在光标处显示/隐藏工具栏

source: ⚠️ Direct Mode - Không có gạch chân nhưng có thể gặp lỗi thêm dấu/double ký tự trong một số trường hợp trên các app khác nhau. Nếu gặp lỗi như vậy hãy bật tính năng này lên và thử lại.
en: ⚠️ Direct Mode - No underline but may encounter diacritics/double character issues in some apps. If you experience such issues, enable this feature and try again.
zh_hans: ⚠️ 直接模式 - 无下划线，但在某些应用中可能遇到声调标记/重复字符问题。如遇此问题，请启用此功能后重试。

source: ⚠️ Match mode cũng áp dụng cho AX patterns. Nếu muốn match chính xác, chọn 'Khớp chính xác'.
en: ⚠️ Match mode also applies to AX patterns. For exact matching, select 'Exact match'.
zh_hans: ⚠️ 匹配模式也适用于AX模式。要精确匹配，请选择"精确匹配"。

source: ⚠️ Secure Input đang BẬT bởi '%@' — XKey không thể nhận phím!
en: ⚠️ Secure Input is ON by '%@' — XKey cannot receive keystrokes!
zh_hans: ⚠️ 安全输入已被"%@"开启——XKey无法接收按键！

source: ⚠️ Yêu cầu tối thiểu %lld modifier keys (Cmd, Option, Ctrl, Shift)
en: ⚠️ Requires at least %lld modifier keys (Cmd, Option, Ctrl, Shift)
zh_hans: ⚠️ 至少需要 %lld 个修饰键（Cmd、Option、Ctrl、Shift）

source: ✅ Secure Input đã TẮT — XKey hoạt động bình thường
en: ✅ Secure Input is OFF — XKey is working normally
zh_hans: ✅ 安全输入已关闭——XKey正常工作

source: ✓ Chuẩn IMKit - Hiển thị gạch chân khi đang gõ. Ổn định và tương thích tốt với mọi ứng dụng.
en: ✓ Standard IMKit - Shows underline while typing. Stable and compatible with all apps.
zh_hans: ✓ 标准IMKit - 输入时显示下划线。稳定且兼容所有应用。

source: 🌍 Nhập mã ngôn ngữ khác...
en: 🌍 Enter custom language code...
zh_hans: 🌍 输入自定义语言代码...

source: 🌐 Dịch sang ngôn ngữ đích
en: 🌐 Translate to target language
zh_hans: 🌐 翻译为目标语言

source: 💡 Kéo thả để sắp xếp thứ tự. Rules phía dưới sẽ override rules phía trên.
en: 💡 Drag to reorder. Rules below override rules above.
zh_hans: 💡 拖拽排序。下方规则覆盖上方规则。

source: 💡 Với các Input Source tiếng Việt khác (Telex, VNI...), bạn có thể tắt XKey để tránh xung đột.
en: 💡 For other Vietnamese Input Sources (Telex, VNI...), you can disable XKey to avoid conflicts.
zh_hans: 💡 对于其他越南语输入源（Telex、VNI...），您可以禁用XKey以避免冲突。

source: 💡 Để trống Title Pattern để áp dụng cho tất cả windows của app
en: 💡 Leave Title Pattern empty to apply to all windows
zh_hans: 💡 留空标题模式以应用于所有窗口

source: 🔄 Dịch sang ngôn ngữ nguồn
en: 🔄 Translate to source language
zh_hans: 🔄 翻译为源语言

source: %@ (giữ 0.5s...)
en: %@ (hold 0.5s...)
zh_hans: %@（按住 0.5 秒...）

source: iCloud đã có dữ liệu thiết lập sẵn
en: iCloud already has existing settings
zh_hans: iCloud 上已有现有设置

source: Gộp local + iCloud
en: Merge local + iCloud
zh_hans: 合并本地与 iCloud

source: Dùng dữ liệu trên iCloud (ghi đè local)
en: Use iCloud data (overwrite local)
zh_hans: 使用 iCloud 数据（覆盖本地）

source: Đẩy local lên iCloud (ghi đè cloud)
en: Push local to iCloud (overwrite cloud)
zh_hans: 将本地推送到 iCloud（覆盖云端）

source: Dữ liệu hiện có trên iCloud: %@. Hãy chọn cách xử lý.
en: Data currently on iCloud: %@. Choose how to handle it.
zh_hans: iCloud 上的数据：%@。请选择处理方式。

source: Tổng dung lượng: %@ / %lld MB
en: Total size: %@ / %lld MB
zh_hans: 总大小：%@ / %lld MB

source: Bản XKey mới hơn đã ghi data này
en: A newer XKey version wrote this data
zh_hans: 较新版本的 XKey 写入了此数据

source: Ứng dụng loại trừ
en: Excluded apps
zh_hans: 排除的应用

source: Dung lượng iCloud vượt giới hạn — xem chi tiết bên dưới
en: iCloud storage limit exceeded — see details below
zh_hans: iCloud 存储超出限制 — 请查看下方详情

source: Đồng bộ thiết lập qua iCloud
en: Sync settings via iCloud
zh_hans: 通过 iCloud 同步设置

source: Đồng bộ ngay
en: Sync now
zh_hans: 立即同步

source: Tự động đồng bộ cài đặt giữa các máy Mac cùng tài khoản iCloud.
en: Automatically sync settings between Macs with the same iCloud account.
zh_hans: 在使用同一 iCloud 账户的 Mac 之间自动同步设置。

source: Dữ liệu được đồng bộ:
en: Data being synced:
zh_hans: 同步的数据：

source: Thiết lập
en: Settings
zh_hans: 设置

source: Từ điển
en: Dictionary
zh_hans: 词典

source: Quy tắc
en: Rules
zh_hans: 规则

source: Đã đồng bộ lúc %@
en: Synced at %@
zh_hans: 已于 %@ 同步

source: Đã đồng bộ
en: Synced
zh_hans: 已同步
